GreatCowBASIC/DATFileGenerator/incfiles/p18F46Q83.inc
;----- C1RXOVIFU Bits -----------------------------------------------------
RFOVIF16         EQU  H'0000'
RFOVIF17         EQU  H'0001'
RFOVIF18         EQU  H'0002'
RFOVIF19         EQU  H'0003'
RFOVIF20         EQU  H'0004'
RFOVIF21         EQU  H'0005'
RFOVIF22         EQU  H'0006'
RFOVIF23         EQU  H'0007'


;----- C1RXOVIFT Bits -----------------------------------------------------
RFOVIF24         EQU  H'0000'
RFOVIF25         EQU  H'0001'
RFOVIF26         EQU  H'0002'
RFOVIF27         EQU  H'0003'
RFOVIF28         EQU  H'0004'
RFOVIF29         EQU  H'0005'
RFOVIF30         EQU  H'0006'
RFOVIF31         EQU  H'0007'


;----- C1TXATIF Bits -----------------------------------------------------
TFATIF0          EQU  H'0000'
TFATIF1          EQU  H'0001'
TFATIF2          EQU  H'0002'
TFATIF3          EQU  H'0003'
TFATIF4          EQU  H'0004'
TFATIF5          EQU  H'0005'
TFATIF6          EQU  H'0006'
TFATIF7          EQU  H'0007'


;----- C1TXATIFH Bits -----------------------------------------------------
TFATIF8          EQU  H'0000'
TFATIF9          EQU  H'0001'
TFATIF10         EQU  H'0002'
TFATIF11         EQU  H'0003'
TFATIF12         EQU  H'0004'
TFATIF13         EQU  H'0005'
TFATIF14         EQU  H'0006'
TFATIF15         EQU  H'0007'


;----- C1TXATIFU Bits -----------------------------------------------------
TFATIF16         EQU  H'0000'
TFATIF17         EQU  H'0001'
TFATIF18         EQU  H'0002'
TFATIF19         EQU  H'0003'
TFATIF20         EQU  H'0004'
TFATIF21         EQU  H'0005'
TFATIF22         EQU  H'0006'
TFATIF23         EQU  H'0007'


;----- C1TXATIFT Bits -----------------------------------------------------
TFATIF24         EQU  H'0000'
TFATIF25         EQU  H'0001'
TFATIF26         EQU  H'0002'
TFATIF27         EQU  H'0003'
TFATIF28         EQU  H'0004'
TFATIF29         EQU  H'0005'
TFATIF30         EQU  H'0006'
TFATIF31         EQU  H'0007'


;----- C1TXREQ Bits -----------------------------------------------------
TXREQ0           EQU  H'0000'
TXREQ1           EQU  H'0001'
TXREQ2           EQU  H'0002'
TXREQ3           EQU  H'0003'
TXREQ4           EQU  H'0004'
TXREQ5           EQU  H'0005'
TXREQ6           EQU  H'0006'
TXREQ7           EQU  H'0007'


;----- C1TXREQH Bits -----------------------------------------------------
TXREQ8           EQU  H'0000'
TXREQ9           EQU  H'0001'
TXREQ10          EQU  H'0002'
TXREQ11          EQU  H'0003'
TXREQ12          EQU  H'0004'
TXREQ13          EQU  H'0005'
TXREQ14          EQU  H'0006'
TXREQ15          EQU  H'0007'


;----- C1TXREQU Bits -----------------------------------------------------
TXREQ16          EQU  H'0000'
TXREQ17          EQU  H'0001'
TXREQ18          EQU  H'0002'
TXREQ19          EQU  H'0003'
TXREQ20          EQU  H'0004'
TXREQ21          EQU  H'0005'
TXREQ22          EQU  H'0006'
TXREQ23          EQU  H'0007'


;----- C1TXREQT Bits -----------------------------------------------------
TXREQ24          EQU  H'0000'
TXREQ25          EQU  H'0001'
TXREQ26          EQU  H'0002'
TXREQ27          EQU  H'0003'
TXREQ28          EQU  H'0004'
TXREQ29          EQU  H'0005'
TXREQ30          EQU  H'0006'
TXREQ31          EQU  H'0007'


;----- C1TRECL Bits -----------------------------------------------------
RERRCNT0         EQU  H'0000'
RERRCNT1         EQU  H'0001'
RERRCNT2         EQU  H'0002'
RERRCNT3         EQU  H'0003'
RERRCNT4         EQU  H'0004'
RERRCNT5         EQU  H'0005'
RERRCNT6         EQU  H'0006'
RERRCNT7         EQU  H'0007'


;----- C1TRECH Bits -----------------------------------------------------
TERRCNT0         EQU  H'0000'
TERRCNT1         EQU  H'0001'
TERRCNT2         EQU  H'0002'
TERRCNT3         EQU  H'0003'
TERRCNT4         EQU  H'0004'
TERRCNT5         EQU  H'0005'
TERRCNT6         EQU  H'0006'
TERRCNT7         EQU  H'0007'


;----- C1TRECU Bits -----------------------------------------------------
EWARN            EQU  H'0000'
RXWARN           EQU  H'0001'
TXWARN           EQU  H'0002'
RXBP             EQU  H'0003'
TXBP             EQU  H'0004'
TXBO             EQU  H'0005'


;----- C1BDIAG0L Bits -----------------------------------------------------
NRERRCNT0        EQU  H'0000'
NRERRCNT1        EQU  H'0001'
NRERRCNT2        EQU  H'0002'
NRERRCNT3        EQU  H'0003'
NRERRCNT4        EQU  H'0004'
NRERRCNT5        EQU  H'0005'
NRERRCNT6        EQU  H'0006'
NRERRCNT7        EQU  H'0007'


;----- C1BDIAG0H Bits -----------------------------------------------------
NTERRCNT0        EQU  H'0000'
NTERRCNT1        EQU  H'0001'
NTERRCNT2        EQU  H'0002'
NTERRCNT3        EQU  H'0003'
NTERRCNT4        EQU  H'0004'
NTERRCNT5        EQU  H'0005'
NTERRCNT6        EQU  H'0006'
NTERRCNT7        EQU  H'0007'


;----- C1BDIAG1L Bits -----------------------------------------------------
EFMSGCNT0        EQU  H'0000'
EFMSGCNT1        EQU  H'0001'
EFMSGCNT2        EQU  H'0002'
EFMSGCNT3        EQU  H'0003'
EFMSGCNT4        EQU  H'0004'
EFMSGCNT5        EQU  H'0005'
EFMSGCNT6        EQU  H'0006'
EFMSGCNT7        EQU  H'0007'


;----- C1BDIAG1H Bits -----------------------------------------------------
EFMSGCNT8        EQU  H'0000'
EFMSGCNT9        EQU  H'0001'
EFMSGCNT10       EQU  H'0002'
EFMSGCNT11       EQU  H'0003'
EFMSGCNT12       EQU  H'0004'
EFMSGCNT13       EQU  H'0005'
EFMSGCNT14       EQU  H'0006'
EFMSGCNT15       EQU  H'0007'


;----- C1BDIAG1U Bits -----------------------------------------------------
NBIT0ERR         EQU  H'0000'
NBIT1ERR         EQU  H'0001'
NACKERR          EQU  H'0002'
NFORMERR         EQU  H'0003'
NSTUFERR         EQU  H'0004'
NCRCERR          EQU  H'0005'
TXBOERR          EQU  H'0007'


;----- C1BDIAG1T Bits -----------------------------------------------------
DCRCERR          EQU  H'0005'
ESI              EQU  H'0006'


;----- C1TEFCONL Bits -----------------------------------------------------
TEFNEIE          EQU  H'0000'
TEFHIE           EQU  H'0001'
TEFFIE           EQU  H'0002'
TEFOVIE          EQU  H'0003'
TEFTSEN          EQU  H'0005'


;----- C1TEFCONH Bits -----------------------------------------------------
UINC             EQU  H'0000'
FRESET           EQU  H'0002'


;----- C1TEFCONT Bits -----------------------------------------------------
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'


;----- C1TEFSTAL Bits -----------------------------------------------------
TEFNEIF          EQU  H'0000'
TEFHIF           EQU  H'0001'
TEFFIF           EQU  H'0002'
TEFOVIF          EQU  H'0003'


;----- C1TEFUA Bits -----------------------------------------------------
TEFUA0           EQU  H'0000'
TEFUA1           EQU  H'0001'
TEFUA2           EQU  H'0002'
TEFUA3           EQU  H'0003'
TEFUA4           EQU  H'0004'
TEFUA5           EQU  H'0005'
TEFUA6           EQU  H'0006'
TEFUA7           EQU  H'0007'


;----- C1TEFUAH Bits -----------------------------------------------------
TEFUA8           EQU  H'0000'
TEFUA9           EQU  H'0001'
TEFUA10          EQU  H'0002'
TEFUA11          EQU  H'0003'
TEFUA12          EQU  H'0004'
TEFUA13          EQU  H'0005'
TEFUA14          EQU  H'0006'
TEFUA15          EQU  H'0007'


;----- C1TEFUAU Bits -----------------------------------------------------
TEFUA16          EQU  H'0000'
TEFUA17          EQU  H'0001'
TEFUA18          EQU  H'0002'
TEFUA19          EQU  H'0003'
TEFUA20          EQU  H'0004'
TEFUA21          EQU  H'0005'
TEFUA22          EQU  H'0006'
TEFUA23          EQU  H'0007'


;----- C1TEFUAT Bits -----------------------------------------------------
TEFUA24          EQU  H'0000'
TEFUA25          EQU  H'0001'
TEFUA26          EQU  H'0002'
TEFUA27          EQU  H'0003'
TEFUA28          EQU  H'0004'
TEFUA29          EQU  H'0005'
TEFUA30          EQU  H'0006'
TEFUA31          EQU  H'0007'


;----- C1FIFOBA Bits -----------------------------------------------------
FIFOBA0          EQU  H'0000'
FIFOBA1          EQU  H'0001'
FIFOBA2          EQU  H'0002'
FIFOBA3          EQU  H'0003'
FIFOBA4          EQU  H'0004'
FIFOBA5          EQU  H'0005'
FIFOBA6          EQU  H'0006'
FIFOBA7          EQU  H'0007'


;----- C1FIFOBAH Bits -----------------------------------------------------
FIFOBA8          EQU  H'0000'
FIFOBA9          EQU  H'0001'
FIFOBA10         EQU  H'0002'
FIFOBA11         EQU  H'0003'
FIFOBA12         EQU  H'0004'
FIFOBA13         EQU  H'0005'
FIFOBA14         EQU  H'0006'
FIFOBA15         EQU  H'0007'


;----- C1FIFOBAU Bits -----------------------------------------------------
FIFOBA16         EQU  H'0000'
FIFOBA17         EQU  H'0001'
FIFOBA18         EQU  H'0002'
FIFOBA19         EQU  H'0003'
FIFOBA20         EQU  H'0004'
FIFOBA21         EQU  H'0005'
FIFOBA22         EQU  H'0006'
FIFOBA23         EQU  H'0007'


;----- C1FIFOBAT Bits -----------------------------------------------------
FIFOBA24         EQU  H'0000'
FIFOBA25         EQU  H'0001'
FIFOBA26         EQU  H'0002'
FIFOBA27         EQU  H'0003'
FIFOBA28         EQU  H'0004'
FIFOBA29         EQU  H'0005'
FIFOBA30         EQU  H'0006'
FIFOBA31         EQU  H'0007'


;----- C1TXQCONL Bits -----------------------------------------------------
TXQNIE           EQU  H'0000'
TXQEIE           EQU  H'0002'
TXATIE           EQU  H'0004'
TXEN             EQU  H'0007'


;----- C1TXQCONH Bits -----------------------------------------------------
UINC             EQU  H'0000'
TXREQ            EQU  H'0001'
FRESET           EQU  H'0002'


;----- C1TXQCONU Bits -----------------------------------------------------
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'


;----- C1TXQCONT Bits -----------------------------------------------------
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'


;----- C1TXQSTAL Bits -----------------------------------------------------
TXQNIF           EQU  H'0000'
TXQEIF           EQU  H'0002'
TXATIF           EQU  H'0004'
TXERR            EQU  H'0005'
TXLARB           EQU  H'0006'
TXABT            EQU  H'0007'


;----- C1TXQSTAH Bits -----------------------------------------------------
TXQCI0           EQU  H'0000'
TXQCI1           EQU  H'0001'
TXQCI2           EQU  H'0002'
TXQCI3           EQU  H'0003'
TXQCI4           EQU  H'0004'


;----- C1TXQUA Bits -----------------------------------------------------
TXQUA0           EQU  H'0000'
TXQUA1           EQU  H'0001'
TXQUA2           EQU  H'0002'
TXQUA3           EQU  H'0003'
TXQUA4           EQU  H'0004'
TXQUA5           EQU  H'0005'
TXQUA6           EQU  H'0006'
TXQUA7           EQU  H'0007'


;----- C1TXQUAH Bits -----------------------------------------------------
TXQUA8           EQU  H'0000'
TXQUA9           EQU  H'0001'
TXQUA10          EQU  H'0002'
TXQUA11          EQU  H'0003'
TXQUA12          EQU  H'0004'
TXQUA13          EQU  H'0005'
TXQUA14          EQU  H'0006'
TXQUA15          EQU  H'0007'


;----- C1TXQUAU Bits -----------------------------------------------------
TXQUA16          EQU  H'0000'
TXQUA17          EQU  H'0001'
TXQUA18          EQU  H'0002'
TXQUA19          EQU  H'0003'
TXQUA20          EQU  H'0004'
TXQUA21          EQU  H'0005'
TXQUA22          EQU  H'0006'
TXQUA23          EQU  H'0007'


;----- C1TXQUAT Bits -----------------------------------------------------
TXQUA24          EQU  H'0000'
TXQUA25          EQU  H'0001'
TXQUA26          EQU  H'0002'
TXQUA27          EQU  H'0003'
TXQUA28          EQU  H'0004'
TXQUA29          EQU  H'0005'
TXQUA30          EQU  H'0006'
TXQUA31          EQU  H'0007'


;----- C1FIFOCON2 Bits -----------------------------------------------------
TFNRFNIE         EQU  H'0000'
TFHRFHIE         EQU  H'0001'
TFERFFIE         EQU  H'0002'
RXOVIE           EQU  H'0003'
TXATIE           EQU  H'0004'
RXTSEN           EQU  H'0005'
RTREN            EQU  H'0006'
TXEN             EQU  H'0007'


;----- C1FIFOCON2H Bits -----------------------------------------------------
UINC             EQU  H'0000'
TXREQ            EQU  H'0001'
FRESET           EQU  H'0002'


;----- C1FIFOCON2U Bits -----------------------------------------------------
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'


;----- C1FIFOCON2T Bits -----------------------------------------------------
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'


;----- C1FIFOSTA2 Bits -----------------------------------------------------
TFNRFNIF         EQU  H'0000'
TFHRFHIF         EQU  H'0001'
TFERFFIF         EQU  H'0002'
RXOVIF           EQU  H'0003'
TXATIF           EQU  H'0004'
TXERR            EQU  H'0005'
TXLARB           EQU  H'0006'
TXABT            EQU  H'0007'


;----- C1FIFOSTA2H Bits -----------------------------------------------------
FIFOCI0          EQU  H'0000'
FIFOCI1          EQU  H'0001'
FIFOCI2          EQU  H'0002'
FIFOCI3          EQU  H'0003'
FIFOCI4          EQU  H'0004'


